README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org660a4b3)
2.  [Resumo e/ou informação extra:](#org2922cee)
3.  [Versão:](#org7036320)
4.  [Data:](#orge344d86)
5.  [Autor de Contato:](#orgb38731a)
6.  [Lista dos Autores:](#org84d7aee)
7.  [Áreas de pesquisa vinculadas:](#orged25a51)
8.  [Vinculo com:](#orgeb8f161)
9.  [Paradigmas:](#orgb2f75c3)
10. [Tipo de Interface:](#orgc741a85)
11. [Plataformas Suportadas:](#org387fa0d)
12. [Linguagens Utilizadas:](#org7cb37d1)
13. [Bibliotecas Utilizadas (dependências):](#org5fb2810)
14. [Softwares utilizados (dependências)](#org05d8ff7)
15. [Tipo de Licença:](#org36df39c)
16. [Links:](#org894237c)


<a id="org660a4b3"></a>

# Nome do Software (ou Biblioteca):

-   DESENVOLVIMENTO DO SOFTWARE APLICAÇÃO DE CORRELAÇÕES PARA CÁLCULO DE PARÂMETROS DE RESERVATÓRIO A PARTIR DE PROPRIEDADES DOS FLUIDOS – MODELAGEM BLACKOIL


<a id="org2922cee"></a>

# Resumo e/ou informação extra:

-   Utilizar correlações empı́ricas para cálculo de parâmetros de um reservatório a

partir de propriedades dos fluidos presentes no mesmo – Modelagem BlackOil.
– Calcular propriedades dos fluidos a partir de dados externos.
– Calcular parâmetros de um reservatório utilizando correlações especı́ficas.


<a id="org7036320"></a>

# Versão:

-   1.0.


<a id="orge344d86"></a>

# Data:

-   2016/2 - segundo semestre.


<a id="orgb38731a"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org84d7aee"></a>

# Lista dos Autores:

-   JOÃO BOSCO MACIEL FILHO
-   SUSANE CHELLI CAIRES GOIS
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orged25a51"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia Reservatório


<a id="orgeb8f161"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgb2f75c3"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgc741a85"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org387fa0d"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org7cb37d1"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org5fb2810"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org05d8ff7"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org36df39c"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org894237c"></a>

# Links:

